package com.example.care_with;

public class QuestionAnswer {

    public static String question[] ={
            "1) 현재의 생활에 대체적으로 만족하십니까?",
            "2) 요즈음 들어 활동량이나 의욕이 많이 떨어지셨습니까?",
            "3) 자신이 헛되이 살고 있다고 느끼십니까?",
            "4) 생활이 지루하게 느껴질 때가 많습니까?",
            "5) 평소에 기분은 상쾌한 편이십니까? ",
            "6) 자신에게 불길한 일이 닥칠 것 같아 불안하십니까?",
            "7) 대체로 마음이 즐거운 편이십니까?",
            "8) 절망적이라는 느낌이 자주 드십니까?",
            "9) 바깥에 나가기가 싫고 집에만 있고 싶습니까?",
            "10) 비슷한 나이의 다른 노인들보다 기억력이 더 나쁘다고 느끼 십니까?",
            "11) 현재 살아 있다는 것이 즐겁게 생각되십니까?",
            "12) 지금의 내 자신이 아무 쓸모없는 사람이라고 느끼십니까?",
            "13) 기력이 좋으신 편이십니까? ",
            "14) 지금 자신의 처지가 아무런 희망도 없다고 느끼십니까?",
            "15) 자신이 다른 사람들의 처지보다 더 못하다고 느끼십니까?"
    };

    public static String choices[][] = {
            {"예","아니오"},
            {"예","아니오"},
            {"예","아니오"},
            {"예","아니오"},
            {"예","아니오"},
            {"예","아니오"},
            {"예","아니오"},
            {"예","아니오"},
            {"예","아니오"},
            {"예","아니오"},
            {"예","아니오"},
            {"예","아니오"},
            {"예","아니오"},
            {"예","아니오"},
            {"예","아니오"},
            {"예","아니오"}
    };

    public static String correctAnswers[] = {
            "예",
            "예",
            "예",
            "예",
            "예",
            "예",
            "예",
            "예",
            "예",
            "예",
            "예",
            "예",
            "예",
            "예",
            "예",
    };

}
